app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "This Is A Post"], ["created_at", "2017-03-13 02:42:39.923392"], ["updated_at", "2017-03-13 02:42:39.923392"]]
---
  def create
    @post = Post.new(post_params)
    @post.save